tinko26/ao/src/ao_sys_xc32_pic32mx_120/ao_ir_u.h
// ----------------------------------------------------------------------------

// MIT License

// Copyright (c) 2022 Stefan Wagner

// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
// FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
// DEALINGS IN THE SOFTWARE.

// ----------------------------------------------------------------------------

// UART interrupts.

// ----------------------------------------------------------------------------

#include <stdbool.h>
#include <sys/attribs.h>
#include <xc.h>

// ----------------------------------------------------------------------------

#ifndef AO_IR_U1_ATTRIBUTE

#define AO_IR_U1_ATTRIBUTE          __ISR(_UART_1_VECTOR, IPL4SOFT)

#endif

#ifndef AO_IR_U1_PRIO

#define AO_IR_U1_PRIO               (4)

#endif

#ifndef AO_IR_U1_SUBPRIO

#define AO_IR_U1_SUBPRIO            (0)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u1e_disable

#define ao_ir_u1e_disable()         { IEC1CLR = _IEC1_U1EIE_MASK; }

#endif

#ifndef ao_ir_u1e_enable

#define ao_ir_u1e_enable()          { IEC1SET = _IEC1_U1EIE_MASK; }

#endif

#ifndef ao_ir_u1e_is_enabled

#define ao_ir_u1e_is_enabled()      ((IEC1 & _IEC1_U1EIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u1e_is_pending

#define ao_ir_u1e_is_pending()      ((IFS1 & _IFS1_U1EIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u1e_reply

#define ao_ir_u1e_reply()           { IFS1CLR = _IFS1_U1EIF_MASK; }

#endif

#ifndef ao_ir_u1e_request

#define ao_ir_u1e_request()         { IFS1SET = _IFS1_U1EIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u1rx_disable

#define ao_ir_u1rx_disable()        { IEC1CLR = _IEC1_U1RXIE_MASK; }

#endif

#ifndef ao_ir_u1rx_enable

#define ao_ir_u1rx_enable()         { IEC1SET = _IEC1_U1RXIE_MASK; }

#endif

#ifndef ao_ir_u1rx_is_enabled

#define ao_ir_u1rx_is_enabled()     ((IEC1 & _IEC1_U1RXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u1rx_is_pending

#define ao_ir_u1rx_is_pending()     ((IFS1 & _IFS1_U1RXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u1rx_reply

#define ao_ir_u1rx_reply()          { IFS1CLR = _IFS1_U1RXIF_MASK; }

#endif

#ifndef ao_ir_u1rx_request

#define ao_ir_u1rx_request()        { IFS1SET = _IFS1_U1RXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u1tx_disable

#define ao_ir_u1tx_disable()        { IEC1CLR = _IEC1_U1TXIE_MASK; }

#endif

#ifndef ao_ir_u1tx_enable

#define ao_ir_u1tx_enable()         { IEC1SET = _IEC1_U1TXIE_MASK; }

#endif

#ifndef ao_ir_u1tx_is_enabled

#define ao_ir_u1tx_is_enabled()     ((IEC1 & _IEC1_U1TXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u1tx_is_pending

#define ao_ir_u1tx_is_pending()     ((IFS1 & _IFS1_U1TXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u1tx_reply

#define ao_ir_u1tx_reply()          { IFS1CLR = _IFS1_U1TXIF_MASK; }

#endif

#ifndef ao_ir_u1tx_request

#define ao_ir_u1tx_request()        { IFS1SET = _IFS1_U1TXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef AO_IR_U2_ATTRIBUTE

#define AO_IR_U2_ATTRIBUTE          __ISR(_UART_2_VECTOR, IPL4SOFT)

#endif

#ifndef AO_IR_U2_PRIO

#define AO_IR_U2_PRIO               (4)

#endif

#ifndef AO_IR_U2_SUBPRIO

#define AO_IR_U2_SUBPRIO            (0)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u2e_disable

#define ao_ir_u2e_disable()         { IEC1CLR = _IEC1_U2EIE_MASK; }

#endif

#ifndef ao_ir_u2e_enable

#define ao_ir_u2e_enable()          { IEC1SET = _IEC1_U2EIE_MASK; }

#endif

#ifndef ao_ir_u2e_is_enabled

#define ao_ir_u2e_is_enabled()      ((IEC1 & _IEC1_U2EIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u2e_is_pending

#define ao_ir_u2e_is_pending()      ((IFS1 & _IFS1_U2EIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u2e_reply

#define ao_ir_u2e_reply()           { IFS1CLR = _IFS1_U2EIF_MASK; }

#endif

#ifndef ao_ir_u2e_request

#define ao_ir_u2e_request()         { IFS1SET = _IFS1_U2EIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u2rx_disable

#define ao_ir_u2rx_disable()        { IEC1CLR = _IEC1_U2RXIE_MASK; }

#endif

#ifndef ao_ir_u2rx_enable

#define ao_ir_u2rx_enable()         { IEC1SET = _IEC1_U2RXIE_MASK; }

#endif

#ifndef ao_ir_u2rx_is_enabled

#define ao_ir_u2rx_is_enabled()     ((IEC1 & _IEC1_U2RXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u2rx_is_pending

#define ao_ir_u2rx_is_pending()     ((IFS1 & _IFS1_U2RXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u2rx_reply

#define ao_ir_u2rx_reply()          { IFS1CLR = _IFS1_U2RXIF_MASK; }

#endif

#ifndef ao_ir_u2rx_request

#define ao_ir_u2rx_request()        { IFS1SET = _IFS1_U2RXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u2tx_disable

#define ao_ir_u2tx_disable()        { IEC1CLR = _IEC1_U2TXIE_MASK; }

#endif

#ifndef ao_ir_u2tx_enable

#define ao_ir_u2tx_enable()         { IEC1SET = _IEC1_U2TXIE_MASK; }

#endif

#ifndef ao_ir_u2tx_is_enabled

#define ao_ir_u2tx_is_enabled()     ((IEC1 & _IEC1_U2TXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u2tx_is_pending

#define ao_ir_u2tx_is_pending()     ((IFS1 & _IFS1_U2TXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u2tx_reply

#define ao_ir_u2tx_reply()          { IFS1CLR = _IFS1_U2TXIF_MASK; }

#endif

#ifndef ao_ir_u2tx_request

#define ao_ir_u2tx_request()        { IFS1SET = _IFS1_U2TXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef AO_IR_U3_ATTRIBUTE

#define AO_IR_U3_ATTRIBUTE          __ISR(_UART_3_VECTOR, IPL4SOFT)

#endif

#ifndef AO_IR_U3_PRIO

#define AO_IR_U3_PRIO               (4)

#endif

#ifndef AO_IR_U3_SUBPRIO

#define AO_IR_U3_SUBPRIO            (0)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u3e_disable

#define ao_ir_u3e_disable()         { IEC1CLR = _IEC1_U3EIE_MASK; }

#endif

#ifndef ao_ir_u3e_enable

#define ao_ir_u3e_enable()          { IEC1SET = _IEC1_U3EIE_MASK; }

#endif

#ifndef ao_ir_u3e_is_enabled

#define ao_ir_u3e_is_enabled()      ((IEC1 & _IEC1_U3EIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u3e_is_pending

#define ao_ir_u3e_is_pending()      ((IFS1 & _IFS1_U3EIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u3e_reply

#define ao_ir_u3e_reply()           { IFS1CLR = _IFS1_U3EIF_MASK; }

#endif

#ifndef ao_ir_u3e_request

#define ao_ir_u3e_request()         { IFS1SET = _IFS1_U3EIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u3rx_disable

#define ao_ir_u3rx_disable()        { IEC1CLR = _IEC1_U3RXIE_MASK; }

#endif

#ifndef ao_ir_u3rx_enable

#define ao_ir_u3rx_enable()         { IEC1SET = _IEC1_U3RXIE_MASK; }

#endif

#ifndef ao_ir_u3rx_is_enabled

#define ao_ir_u3rx_is_enabled()     ((IEC1 & _IEC1_U3RXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u3rx_is_pending

#define ao_ir_u3rx_is_pending()     ((IFS1 & _IFS1_U3RXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u3rx_reply

#define ao_ir_u3rx_reply()          { IFS1CLR = _IFS1_U3RXIF_MASK; }

#endif

#ifndef ao_ir_u3rx_request

#define ao_ir_u3rx_request()        { IFS1SET = _IFS1_U3RXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u3tx_disable

#define ao_ir_u3tx_disable()        { IEC2CLR = _IEC2_U3TXIE_MASK; }

#endif

#ifndef ao_ir_u3tx_enable

#define ao_ir_u3tx_enable()         { IEC2SET = _IEC2_U3TXIE_MASK; }

#endif

#ifndef ao_ir_u3tx_is_enabled

#define ao_ir_u3tx_is_enabled()     ((IEC2 & _IEC2_U3TXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u3tx_is_pending

#define ao_ir_u3tx_is_pending()     ((IFS2 & _IFS2_U3TXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u3tx_reply

#define ao_ir_u3tx_reply()          { IFS2CLR = _IFS2_U3TXIF_MASK; }

#endif

#ifndef ao_ir_u3tx_request

#define ao_ir_u3tx_request()        { IFS2SET = _IFS2_U3TXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef AO_IR_U4_ATTRIBUTE

#define AO_IR_U4_ATTRIBUTE          __ISR(_UART_4_VECTOR, IPL4SOFT)

#endif

#ifndef AO_IR_U4_PRIO

#define AO_IR_U4_PRIO               (4)

#endif

#ifndef AO_IR_U4_SUBPRIO

#define AO_IR_U4_SUBPRIO            (0)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u4e_disable

#define ao_ir_u4e_disable()         { IEC2CLR = _IEC2_U4EIE_MASK; }

#endif

#ifndef ao_ir_u4e_enable

#define ao_ir_u4e_enable()          { IEC2SET = _IEC2_U4EIE_MASK; }

#endif

#ifndef ao_ir_u4e_is_enabled

#define ao_ir_u4e_is_enabled()      ((IEC2 & _IEC2_U4EIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u4e_is_pending

#define ao_ir_u4e_is_pending()      ((IFS2 & _IFS2_U4EIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u4e_reply

#define ao_ir_u4e_reply()           { IFS2CLR = _IFS2_U4EIF_MASK; }

#endif

#ifndef ao_ir_u4e_request

#define ao_ir_u4e_request()         { IFS2SET = _IFS2_U4EIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u4rx_disable

#define ao_ir_u4rx_disable()        { IEC2CLR = _IEC2_U4RXIE_MASK; }

#endif

#ifndef ao_ir_u4rx_enable

#define ao_ir_u4rx_enable()         { IEC2SET = _IEC2_U4RXIE_MASK; }

#endif

#ifndef ao_ir_u4rx_is_enabled

#define ao_ir_u4rx_is_enabled()     ((IEC2 & _IEC2_U4RXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u4rx_is_pending

#define ao_ir_u4rx_is_pending()     ((IFS2 & _IFS2_U4RXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u4rx_reply

#define ao_ir_u4rx_reply()          { IFS2CLR = _IFS2_U4RXIF_MASK; }

#endif

#ifndef ao_ir_u4rx_request

#define ao_ir_u4rx_request()        { IFS2SET = _IFS2_U4RXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u4tx_disable

#define ao_ir_u4tx_disable()        { IEC2CLR = _IEC2_U4TXIE_MASK; }

#endif

#ifndef ao_ir_u4tx_enable

#define ao_ir_u4tx_enable()         { IEC2SET = _IEC2_U4TXIE_MASK; }

#endif

#ifndef ao_ir_u4tx_is_enabled

#define ao_ir_u4tx_is_enabled()     ((IEC2 & _IEC2_U4TXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u4tx_is_pending

#define ao_ir_u4tx_is_pending()     ((IFS2 & _IFS2_U4TXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u4tx_reply

#define ao_ir_u4tx_reply()          { IFS2CLR = _IFS2_U4TXIF_MASK; }

#endif

#ifndef ao_ir_u4tx_request

#define ao_ir_u4tx_request()        { IFS2SET = _IFS2_U4TXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef AO_IR_U5_ATTRIBUTE

#define AO_IR_U5_ATTRIBUTE          __ISR(_UART_5_VECTOR, IPL4SOFT)

#endif

#ifndef AO_IR_U5_PRIO

#define AO_IR_U5_PRIO               (4)

#endif

#ifndef AO_IR_U5_SUBPRIO

#define AO_IR_U5_SUBPRIO            (0)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u5e_disable

#define ao_ir_u5e_disable()         { IEC2CLR = _IEC2_U5EIE_MASK; }

#endif

#ifndef ao_ir_u5e_enable

#define ao_ir_u5e_enable()          { IEC2SET = _IEC2_U5EIE_MASK; }

#endif

#ifndef ao_ir_u5e_is_enabled

#define ao_ir_u5e_is_enabled()      ((IEC2 & _IEC2_U5EIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u5e_is_pending

#define ao_ir_u5e_is_pending()      ((IFS2 & _IFS2_U5EIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u5e_reply

#define ao_ir_u5e_reply()           { IFS2CLR = _IFS2_U5EIF_MASK; }

#endif

#ifndef ao_ir_u5e_request

#define ao_ir_u5e_request()         { IFS2SET = _IFS2_U5EIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u5rx_disable

#define ao_ir_u5rx_disable()        { IEC2CLR = _IEC2_U5RXIE_MASK; }

#endif

#ifndef ao_ir_u5rx_enable

#define ao_ir_u5rx_enable()         { IEC2SET = _IEC2_U5RXIE_MASK; }

#endif

#ifndef ao_ir_u5rx_is_enabled

#define ao_ir_u5rx_is_enabled()     ((IEC2 & _IEC2_U5RXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u5rx_is_pending

#define ao_ir_u5rx_is_pending()     ((IFS2 & _IFS2_U5RXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u5rx_reply

#define ao_ir_u5rx_reply()          { IFS2CLR = _IFS2_U5RXIF_MASK; }

#endif

#ifndef ao_ir_u5rx_request

#define ao_ir_u5rx_request()        { IFS2SET = _IFS2_U5RXIF_MASK; }

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u5tx_disable

#define ao_ir_u5tx_disable()        { IEC2CLR = _IEC2_U5TXIE_MASK; }

#endif

#ifndef ao_ir_u5tx_enable

#define ao_ir_u5tx_enable()         { IEC2SET = _IEC2_U5TXIE_MASK; }

#endif

#ifndef ao_ir_u5tx_is_enabled

#define ao_ir_u5tx_is_enabled()     ((IEC2 & _IEC2_U5TXIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_u5tx_is_pending

#define ao_ir_u5tx_is_pending()     ((IFS2 & _IFS2_U5TXIF_MASK) ? true : false)

#endif

#ifndef ao_ir_u5tx_reply

#define ao_ir_u5tx_reply()          { IFS2CLR = _IFS2_U5TXIF_MASK; }

#endif

#ifndef ao_ir_u5tx_request

#define ao_ir_u5tx_request()        { IFS2SET = _IFS2_U5TXIF_MASK; }

#endif

// ----------------------------------------------------------------------------
